#+ASSIGNMENT: exam-1-3
#+POINTS: 4
#+CATEGORY: exam1
#+RUBRIC: (("technical" . 0.7) ("presentation" . 0.3))
#+DUEDATE: <2015-10-07 Wed 10:20>

The gas-phase decomposition reaction \ce{A \rightarrow 3B} occurs in a packed bed reactor. Assume the reaction is a first order reaction, $r_A = k C_A$  with a rate constant of 0.02 1/min. If the volumetric flowrate into the reactor is 50 mL/min, the inlet pressure is 5 atm of pure A at 500K, and the packed bed is known to have a pressure drop parameter of 0.003 atm/kg of packing,

1. Estimate the mass of packing required to achieve 98% conversion of A.

2. Calculate the volumetric flow at the exit of the reactor.
#+BEGIN_SRC python
import numpy as np
from scipy.optimize import fsolve
import matplotlib.pyplot as plt
from scipy.integrate import odeint
from pycse import odelay

k = 0.02 #1/min
v0 = 0.05 # L/min
P0 = 5 # atm
T = 500 #K
alpha = 0.003 # atm/kg
R = 0.0082 # L*atm/(K*mol)
Fa0= P0*v0 /T/R
Faexit = Fa0*(1-0.98)

def func(F,W):
    Fa, Fb, y = F
    Ft = Fa + Fb  
    P = P0 * y
    Pa = Fa/Ft * P
    Pb = Fb/Ft * P
    Ca = Pa/T/R
    Cb = Pb/T/R
    ra = -k *Ca
    rb = -3 *ra
    
    dFadW = ra
    dFbdW = rb
    dydW = -alpha/(2*y)*Ft/Fa0
    return [dFadW, dFbdW, dydW]
def event(F,W):
    Fa, Fb, y = F
    value = Fa - Faexit
    isterminal = True
    direction = 0
    return value, isterminal, direction

y0 = 1
F0 = [Fa0,0,y0]
Wspan = np.linspace(0,50)
sol, t, Xe,Ye, Ie = odelay(func,F0, Wspan,[event])
print ('The mass of packing is {0} kg'.format( sol[-1]))
Ftexit = sum(t[-1,0:2])
vexit = Ftexit/Fa0 * v0
print('The exit volumetric flowrate is {} L/min'.format(vexit))
#+END_SRC

#+RESULTS:
: The mass of packing is 25.6723375071 kg
: The exit volumetric flowrate is 0.148 L/min

#+TURNED-IN: Wed Oct  7 10:19:42 2015

* feedback
[[elisp:(goto-char 1563)][(harithirumalai) line 55:]] missing pressure correction term


* Grade
#+technical: A/B
#+presentation: A
#+GRADE: 0.830
#+GRADED-BY: Hari Thirumalai
